sdaiPromoteModel(Sdai_instS*)
\details
Promotes access in the read-write mode for a specified model.
\param model [in] A model to be promoted.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NEXS - Transaction does not exist.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository not open.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiMX_RW - SDAI-model access read-write.
* sdaiSY_ERR - Underlying system error.
\code
SdaiSession session = sdaiOpenSession();
SdaiRep repo = sdaiOpenRepositoryBN(session, "test_repository");
SdaiModel model = sdaiCreateModelBN(repo, "default", "ifc4");
...
model = sdaiAccessModel(model, sdaiRO);
sdaiPromoteModel(model);